[
  {
    "slug": "best-dentist-poor-google-ratings",
    "title": "You are the Best Dentist in Town - And Still Have Poor Google Ratings 😒",
    "description": "Why Amazing Dentists Have Poor Google Ratings. You are an amazing dentist, you know it, you hear the same from your patients. But, sometimes your online profile doesn't reflect the same.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-06-04",
    "readTime": "4 min read",
    "category": "Reputation Management",
    "content": "Let's say you have 99% of your patients go home happy with your service, and 1% or fewer are not satisfied. Your happy patients that represent 99% of your total patients are not going to go out on their own and write a Google review for your business. But, the 1% who did not like your service is going to go out and write a negative review.\n\n## Why do the unhappy 1% write a bad review?\n\nThese are the patients that are most vocal about their experience. Maybe there was a miscommunication, maybe they are really impacted, they are angry, and somehow want to express their frustration and want to punish. Writing a bad review for the business is one of the easier means available to punish. Or, sometimes they even think that they are helping other individuals by telling the world not to seek your services.\n\nIf this continues to happen for a period of a year or 2, your Google profile is going to look something like this. To the outer world, it shows 60% of your patients are unhappy with your service. But, that's not the reality.\n\nSo, how can you bring your online profile close to reality? You have to turn some of your happy patients into good reviews.\n\nI hope this helps. Let me know if you have any questions in the comments section below."
  },
  {
    "slug": "overpaying-dental-software",
    "title": "Why You Might Be Overpaying for Your Dental Patient Communication Software?",
    "description": "As technology evolves, the products and services become cheaper and more efficient as well. And this is especially true for software products/services.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-05-21",
    "readTime": "6 min read",
    "category": "Practice Management",
    "content": "As technology evolves, the products and services become cheaper and more efficient as well. And this is especially true for software products/services.\n\nLet me begin with a personal story.\n\nSeven years ago, we purchased a house. As every family does, we wanted to install a home security system as soon as we purchased the house. At the time, I did not know many options, and the only one I knew was ADT, so we went for it.\n\nAlthough the installation process was a little complicated, we got help from the ADT technician, and he took care of the setup for us. We loved it; we felt safe; I could operate it with my cell phone, all is well. I have been using the ADT security system for six years and pay around $60 per month. I was quite happy using the service until I learned about alternatives (e.g., Ring, SimpliSafe, etc.).\n\nAnd much to my surprise, I found that these security systems cost just a fraction of what I was paying. I also noticed that they are simple to use. I just turn them on, and they're ready to use. There's no setup, no installation, no technician coming to your house.\n\nAfter some procrastination, I finally made the switch to Ring Security System. I was able to order the device online and set it up myself. I only have to pay for the device, and there's no monthly fee, although I can get emergency support for less than $10 a month.\n\nI couldn't be more satisfied with the switch. I was able to get all the features offered by ADT, operate it on my mobile phone. The Ring device was compact enough not to take up much space in my home, and I am able to save $720 annually.\n\nThat's the end of my story.\n\nNow, coming back to the patient engagement services for dental offices, over the years, I got a chance to speak with hundreds of dental practitioners belonging to different categories (pediatric, orthodontic, and endodontic, etc.), I have observed that 90% of them were overpaying for their dental patient communication software.\n\nHere are some of the core reasons I felt many dental practices are overpaying for their patient communication software.\n\n## You Only Use a Few Features\n\nIn most cases, dental offices make use of the dental patient communication software for two main purposes.\n\n- Send automated appointment reminders and get confirmations.\n- Send and receive text messages to their patients.\n\nThe rest of the features are rarely or not used at all, but your service provider might be charging for all those features that you may not even be aware of.\n\n## Drop-in Communication Costs\n\nWith the evolution of technology, communication costs have dropped drastically in the past few years. Remember those days when your mobile service carrier (AT&T, and Verizon, etc.) used to charge 5 cents for each text message sent or received? Then WhatsApp happened, and the mobile carriers were forced to make text messaging free of cost to the customers.\n\nThe same thing happened for business texting too. The cost of business texting has come down drastically in the past few years. If you are paying more than $100/month for your text messaging and confirmation service in your dental office, it's time to renegotiate with your current vendor.\n\n## Usage Volume Matters\n\nNot all dental offices have a large volume of daily appointments; take, for example, dental offices that provide specialized services like endodontics, periodontics, etc. The specialized offices would be seeing fewer patients daily, and the usage of a dental patient communication software is very minimal. Although it is convenient to have a patient texting and appointment confirmation service, it is not required to pay the same price as the office with a large appointment volume.\n\n## How to Choose a Dental Patient Communication Software That Suits Your Needs?\n\nWhile choosing a dental patient communication software, here are a few things you may keep in mind:\n\n- Consider the ones that offer a generous free trial, so you have adequate time to evaluate the product and decide if it's right for you.\n- Look for a service with no long-term contracts involved, so if you don't like the service, you can move onto another one without much difficulty.\n- Check whether the service provider offers you flexible pricing plans based on the services that you need. This way, you won't have to pay for features you don't use. And if you need more features in the future, you can add them.\n- Start small. Start with the essential features and then add on additional features as you get used to the system.\n- You will find various dental patient communication softwares in the market, especially for dental practices. While you explore the platforms, look at the features they offer and then ask yourself, what are the features that you would be using regularly.\n\n## In the Final Analysis\n\nMost of the Patient Engagement Services have very similar features. If you are familiar with one system, you will have no trouble accessing a similar one. So, you don't have to worry about the transition because, in most cases, it's seamless. If you find a better-priced product, do not be afraid to give it a try.\n\nLook at the features you need most, pay close attention to how frequently you use them, justify the fees you're paying for the benefits you're receiving, and then make a prudent decision."
  },
  {
    "slug": "dental-appointment-reminders",
    "title": "Why Are Dental Appointment Reminders Important?",
    "description": "The best way to ensure that you do something without fail is two critical things. One, you need to block your calendar to know exactly when (and on which date) you should take action.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-05-21",
    "readTime": "6 min read",
    "category": "Patient Communication",
    "content": "The best way to ensure that you do something without fail is two critical things.\n\nOne, you need to block your calendar to know exactly when (and on which date) you should take action.\n\nTwo, you need to have a system of reminding yourself that you have a task to attend at such and such date.\n\nOnce these two elements are placed, you know you won't miss out on a given task you set out for yourself.\n\nNow, if we talk about dental appointment reminders, it does the same job.\n\nIt helps your patients know beforehand that they need to block their calendars for a particular date for the appointment, and they shouldn't miss the appointment because they need to rebook for another slot.\n\nIn this guide, we will investigate why dental appointment reminders are important for your dental practices and how it helps you reduce the no-show-rates of your patients.\n\n## Why are dental appointment reminders important?\n\nLittle things are big things. And when you pay heed to the little things in your business, your business drastically improves.\n\nFor your dental practice, one such little thing is dental appointment reminders. You may use appointment reminder software or go with a top-notch dental patient engagement app. The idea is to make sure that you take care of this tiny thing.\n\nHere's why.\n\nDo you know how much this tiny little thing called the appointment costs the healthcare industry? A whopping $150 billion a year.\n\nAnd dental clinics are equally affected by this disease called 'no-show.'\n\nA study claimed that a dental clinic loses 443 production hours from a 'no-show.'\n\nSo if your dental office is not generating the revenue you're looking for, maybe it's because of this one tiny thing called missed appointment.\n\nTake charge of this little stuff, and you'll make more money than you've ever imagined possible from your dental practices.\n\nWhen you want to make sure that no appointments are missed, you may think that you cannot do much about it.\n\nBut with dental appointment reminders, you are in a driver's seat.\n\nYou can transmute the no-shows into a fully-booked appointment chamber.\n\nYou'd know that how many tasks your front desk executive/s handles. It could be a hundred. And amid all of these tasks, if you tell them to pick up the phone to send the patients - appointment reminders, it's taxing to add one more task to their kitty.\n\nSolution? Make it automated.\n\nUse the appointment reminder software that's easy to use and doesn't cost a fortune. And make dental appointment reminders seamless.\n\nWhat if you know that by tweaking this tiny thing, you can skyrocket your revenue? Won't you do it? Who won't?\n\nHere's why sending personalized dental appointment reminders will skyrocket your revenue:\n\n- When you automate sending appointment reminders, you will have fewer overhead costs, and your return on investment would also be higher.\n- When you send a personalized reminder, your patient understands that you care and they can trust you. More trust equals more referrals. More referrals equal more revenue.\n- Fewer patients will miss appointments, meaning you will have more success rate with whoever book the appointments.\n- More patients will show up for the appointments, meaning you will earn more money and have more influence.\n\n## When to send dental appointment reminders?\n\nYou may think why we're focusing on the timing of sending dental appointment reminders. Because it makes the difference between whether your patients will show up at said date and time or not.\n\nA study published in AJMC concluded that when the patients are sent two reminders (at 3 days prior and 1 day prior) instead of one reminder, patients tend not to miss the appointments. And sending two reminders instead of one also doesn't reduce patient satisfaction.\n\nWhen you opt for a medium that a patient prefers to communicate through, there's an instant win-win for both of you.\n\nThe research published in the Angle Orthodontist concluded that SMS & Email are the most effective way of sending appointment reminders than phone calls. It also said that SMS has the lowest no-show rate, i.e., 1.90%, email has the second-lowest no-show rate, i.e., 2.68%, and the phone calls have the highest no-show rate, i.e. 3.49%.\n\n## Dos and don'ts of dental appointment reminders\n\n- Set a separate appointment reminder for your new patients (and the method of sending the reminders would be different than your existing patients) since they don't know what to expect from your dental office\n- Let your patients choose the medium to receive reminders from - phone calls/emails/text\n- Send your patients a personalized appointment reminder\n- Use two reminders instead of one to improve the return on investment (ROI)\n- There are a hundred patient engagement platforms in the market. You need to choose one that's user-friendly, hassle-free, and provides training to your executives whenever required.\n\n- Don't use any appointment reminder software because you're in a hurry to install a patient engagement platform. Make a list of pros and cons, and then make a prudent decision.\n- Don't send multiple reminders separately to different members of the same family. Club the reminders and send them twice before the appointment\n- Even if your patients equal money, don't treat them as the source of revenue. Treat them as human. Because human connection always goes a long way\n\n## In the final analysis\n\nIt's important to think beyond profits. Remember that you're in the business of reducing the suffering of your patients the way we have made this for you.\n\nWe wish you all the very best and hope this has inspired you to embrace dental appointment reminders and make a tiny tweak in your dental practice."
  },
  {
    "slug": "paperless-dental-forms",
    "title": "How to Be an Efficient Practice With Paperless Dental Forms?",
    "description": "In today's digital age, paperless dental forms have become an essential tool for modern dental practices looking to improve efficiency, reduce costs, and enhance the patient experience.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-03-15",
    "readTime": "8 min read",
    "category": "Practice Management",
    "content": "In today's digital age, paperless dental forms have become an essential tool for modern dental practices looking to improve efficiency, reduce costs, and enhance the patient experience. This comprehensive guide will show you how to transform your practice with digital forms.\n\n## The Problems with Paper Forms\n\nTraditional paper forms create numerous challenges for dental practices:\n\n- Poor patient experience with repetitive paperwork\n- Environmental impact\n- Difficulty retrieving patient information\n- Risk of lost or damaged documents\n- Storage space requirements\n- Time-consuming manual data entry\n\n## Benefits of Paperless Dental Forms\n\n### 1. Improved Efficiency\n\nDigital forms eliminate the need for manual data entry, saving your staff valuable time that can be better spent on patient care. Forms can be completed before the appointment, and information automatically syncs with your practice management system.\n\n### 2. Better Patient Experience\n\nPatients can complete forms from the comfort of their home using their smartphone, tablet, or computer. No more arriving early to fill out clipboards of paperwork in the waiting room.\n\n### 3. Cost Savings\n\nGoing paperless eliminates printing costs, reduces storage needs, and minimizes administrative overhead. Many practices see significant cost savings within the first year of implementation.\n\n### 4. Enhanced Security\n\nDigital forms are encrypted and stored securely, meeting HIPAA compliance requirements. No more risk of paper forms being lost or accessed by unauthorized individuals.\n\n### 5. Environmental Benefits\n\nReducing paper usage helps your practice become more environmentally sustainable, which is increasingly important to patients.\n\n## How to Implement Paperless Forms\n\n### Step 1: Choose the Right Software\n\nSelect a dental patient communication platform that offers paperless forms integrated with your practice management system. Look for features like:\n\n- HIPAA compliance\n- E-signature capability\n- Automatic data sync\n- Mobile-friendly design\n- Easy form customization\n\n### Step 2: Digitize Your Existing Forms\n\nConvert all your current paper forms into digital versions. This includes:\n\n- HIPAA acknowledgments\n- Insurance information\n- Consent forms\n- Medical history questionnaires\n- Patient registration forms\n\n### Step 3: Train Your Team\n\nEnsure all staff members understand how to use the new system. Provide training on:\n\n- Explaining the process to patients\n- Troubleshooting common issues\n- Reviewing completed forms\n- Sending forms to patients\n\n### Step 4: Communicate with Patients\n\nInform your patients about the new paperless system through:\n\n- In-office signage\n- Social media posts\n- Text messages\n- Email announcements\n\n## Best Practices for Success\n\n### Make It Easy for Patients\n\nSend forms via text message or email with a direct link. Ensure the forms are mobile-optimized so patients can complete them on any device.\n\n### Send Forms in Advance\n\nAutomatically send forms when appointments are scheduled, giving patients plenty of time to complete them before their visit.\n\n### Use Smart Logic\n\nImplement conditional logic in your forms so patients only see relevant questions based on their previous answers, making the process faster.\n\n### Integrate with Your PMS\n\nEnsure your paperless forms solution integrates seamlessly with your practice management software to eliminate duplicate data entry.\n\n### Follow Up on Incomplete Forms\n\nSend automatic reminders to patients who haven't completed their forms before their appointment.\n\n## Common Challenges and Solutions\n\n### Challenge: Patients Without Email or Smartphones\n\nSolution: Keep tablets in your office for patients to complete forms upon arrival. This still saves time compared to paper while accommodating all patients.\n\n### Challenge: Staff Resistance to Change\n\nSolution: Involve staff in the selection process and demonstrate how the new system will make their jobs easier. Provide thorough training and ongoing support.\n\n### Challenge: Technical Issues\n\nSolution: Choose a reliable platform with excellent customer support. Have a backup plan for rare system outages.\n\n## Measuring Success\n\nTrack these metrics to measure the impact of your paperless forms:\n\n- Staff productivity improvements\n- Patient satisfaction scores\n- Reduction in paper and printing costs\n- Time saved on administrative tasks\n- Percentage of forms completed before appointments\n\n## Conclusion\n\nImplementing paperless dental forms is one of the most impactful changes you can make to improve practice efficiency. By eliminating paper forms, you'll save time, reduce costs, enhance patient satisfaction, and position your practice for future growth.\n\nThe transition may seem daunting, but with the right platform and approach, most practices successfully complete the switch within a few weeks. The long-term benefits far outweigh the initial implementation effort.\n\nReady to go paperless? Start by evaluating dental communication platforms that offer integrated paperless forms solutions, and take the first step toward a more efficient practice."
  },
  {
    "slug": "online-reputation-management-for-dentists",
    "title": "How Important Is Online Reputation Management For Dentists?",
    "description": "Your brand is what people say about you when you're not in the room. Do you also wonder how people perceive your practice? You will get your answer by evaluating the Online Reputation of your practice.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-05-15",
    "readTime": "6 min read",
    "category": "Reputation Management",
    "content": "Your brand is what people say about you when you're not in the room.' – Jeff Bezos, Founder of Amazon\n\nDo you also wonder how people perceive your practice? You will get your answer by evaluating the Online Reputation of your practice. Everyone has an Online Reputation which basically acts as a shadow of their brand. To maintain goodwill, one has to manage their online reputation efficiently.\n\nOnline Reputation Management for dentists means taking control over the internet conversation with your patients. Its strategies and techniques ensure that the appropriate content comes up for you when people seek you out. Online reputation management's objective is to strike a balance, counter false trends, and allow you to put your best foot forward.\n\n## Importance of Online Reputation Management for Dentists\n\nThe digital age has made it crucial for dentists to have a strong online reputation. This confidence bridge indicates the bond between you and your patients, and it is a key factor in attracting new patients. A high share of patients relies on online reviews as a source of recommendation for a dentist in all regions. Their percentage is highest in the United States – 87%, followed by Australia – 66%, and Europe – 45%.\n\nOnline Reputation Management can help your practice in the following ways:\n\n- Better online presence - Positive reviews on platforms like Google can help your practice get a boost in search results. Suppose you distribute the reviews across multiple sites, the prospects of getting much better SEO rankings increases.\n- Reduces risk of bad reviews - A bad reputation can become self-perpetuating as bad news spreads really fast. The goal of an effective online reputation management strategy is to minimize the risk of reputation damage.\n- Competitive edge - The best online reputation management can help you differentiate yourself from other local dental offices. If the other dental offices in your area ignore their online reputation, you can shine in the eyes of potential patients.\n- Trust building - The reputation of practice plays a big role in the trust patients have for it. Practice with a good reputation will be trusted more than one with negative feedback that's not handled properly.\n- Good first impression - Patient's frequently begun their search for a new dentist by checking online reviews. As such, it is important to have a strong online reputation with an average of four-star reviews.\n\n## Online review platforms\n\nWhile many review websites are available, the popular ones for dentists are Yelp, Google, and Facebook.\n\n- Facebook - Social media reviews and recommendations act as the ultimate social proof method. Recommendations can be posted on Facebook for your dental practice. Recommended content is displayed within your page, so anybody who visits can see what other visitors have written.\n- Google - There's no surprise that Google reviews are a major player in online reviews since Google is the world's most popular search engine. When ranking websites, Google's algorithm takes reviews into account. Reviews that contain the keyword you want people to use when searching can greatly boost your search engine rankings.\n- Yelp - Yelp pages are highly noticeable in search engines, particularly in searches for dental services. By receiving reviews on Yelp, you've got a better chance of appearing on these \"Best of\" lists, which will help your website traffic and visibility grow.\n\n## How to manage your Online Reputation?\n\nAn Online Reputation Management for dentists enhances, maintains, and strengthens your positive online reputation, leading to increased foot traffic at your practice. The Health Insurance Portability and Accountability Act (HIPAA), intended to protect patient's health information, makes it slightly tricky for dentists to respond to reviews. Be sure to avoid referring to any specifics about medical care or the patient's identity when responding to patient feedback on online review sites.\n\nAt the same time, craft your reply in such a manner that it shows your genuine desire to engage with the patient and solve any problems raised. Thus, finding the right practice management software partner is essential for undertaking the task of reputation management for dentists. The ideal partner will help in distinct ways like:\n\n- Share positive reviews on your website - Provide all positive comments about your practice on your website. A great website combined with great patient testimonials will increase your credibility and convert most visitors into patients.\n- Share patient reviews with potential patients - Let them know how satisfied your patients are with your service. Ensure you share patient reviews on all popular online review sites with your potential patients on social media platforms.\n- Respond instantly to reviews - Receive instant patient feedback across multiple platforms via a single dashboard. Automatically acknowledge incoming reviews using predefined rules. Send personalized responses to patient feedback to improve patient sentiment.\n- Address any negative feedback - Negative reviews can cost your practice more new patients than positive reviews can restore. By sending you alerts about any negative patient feedback you receive via online patient grievances, reputation management software can help you respond quickly.\n- Positive feedback - Positive reviews of your practice on top review sites and search engines can help you acquire more new patient appointments. Online Reputation Management for dentists maximizes the number of positive patient reviews you receive by following a strategic review request process\n\n## How can PracticeDilly assist in creating Online Reputation Management for dentists?\n\nPracticeDilly makes it easy for your patients to post a positive review with the click of a button. Our patient engagement platform identifies patients most likely to give your practice a 5-star rating and recommends them to their social network. PracticeDilly gives you complete control of who you want to request reviews from. Thereby, we help you get reviews on the websites like Google, Yelp, and Facebook that matter most."
  },
  {
    "slug": "text-messaging-for-dentists",
    "title": "How Important Is Text Messaging For Dentists?",
    "description": "Text messaging is a growing phenomenon. The increase and use of text messaging by both patients and doctors reflects the evolution of the medical practice as well as the value of different communication channels.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-05-15",
    "readTime": "6 min read",
    "category": "Patient Communication",
    "content": "Jennifer M. Schwer (2006) stated that text messaging is a \"growing phenomenon.\" She noted, \"The increase and use of text messaging by both patients and doctors reflects the evolution of the medical practice as well as the value of different communication channels in developing and maintaining relationships with patients.\"\n\nConsidering the time crunch that every office faces, hassle-free communication becomes more important to provide quality services. Also, with the pandemic in place, text messaging becomes even more necessary to maintain social distancing.\n\n## What is Two-way texting?\n\nThe concept of two-way texting enables users to send, receive, and reply to messages. Text messaging for dentists helps to improve their business communication with patients. It allows dental practices to connect with their patients by sending alerts, reminders, confirmations, and SMS marketing campaigns.\n\n## Latest Texting Statistics\n\nThese text marketing stats will give you an idea of how text messaging is catching the eye of marketers:\n\n- People will definitely see what you send them — SMS open rates are as high as 98%.\n- 92% of U.S. adults carry text-enabled phones, 98% of smartphone users use text on a regular basis, but only 14% of companies text with consumers. There's a huge opportunity few brands are taking advantage of to reach people in a space that isn't yet overly crowded.\n- 85% of customers prefer receiving text messages over a phone call or email.\n- 5 billion people globally send and receive SMS messages. That's about 65% of the world's population.\n- Stats demonstrate that 64% of customers want to use text messaging to make or update a reservation.\n\n## Benefits of text messaging for dentists\n\n- BUSINESS REVENUE - A patient is the kingpin of the dental services market. The patient's loyalty is increased by providing text messaging service as an easier and efficient medium of communication. This helps in your dental business growth.\n- IMPROVES PATIENT SATISFACTION - Direct contact and an ongoing relationship with the dentist are essential to many patients' overall wellbeing. In general, a secure messaging platform compliant with HIPAA is important in improving dental patient experience and overall health outcomes. This helps in building trust amongst patients.\n- INCREASED SECURITY AND COMPLIANCE - Using two-way texting as a unified channel can reduce the possibility of your office staff sending messages to patients through their personal numbers. Thus, all your data remains private with our high-end security protocols.\n- EFFECTIVE TOOL - Nearly 70% of people feel this two-way texting is a productive method of communicating with business personnel. Texting has brought ease to send and receive notifications from anywhere and at any time in the world. This versatility and ease of use make it a popular tool.\n- TIME EFFICIENT - Texting messaging for dentists can save them considerable time. Instead of calling every patient, they can send a single message to multiple patients with the touch of a button.\n- BUSINESS CONVENIENCE - Around 94% of the businesses currently using texting service have found it a successful communication mode. With two-way, your office staff can notify patients about their appointments via our easy-to-use messaging platform, and patients can confirm appointments ahead of time. This saves time for you and your patients!\n- PATIENTS PREFERENCE - Be it your young or old patients; everyone prefers texts over phone calls or emails. It is always easier to send and receive text messages as it is just a matter of a single click and can be done through our website or even mobile app. Two-way texting means you can readily engage in conversation with your patients on their terms.\n\n## In what areas do dental practices use texting?\n\n- Contactless Check-In Experience - Consequently, COVID-19 makes it imperative to ensure patients don't wait in an unattended room. Text messaging for dentists can help them schedule easy appointments by reducing touchpoints while simultaneously following the social distancing norms.\n- Provide Quick Answers - Text messaging for dentists lets them respond to emergencies or postoperative complications. Outside of business hours, you can keep an eye on incoming texts and respond to them quickly to all the queries. It's a great way to foster trust and strengthen long-lasting relationships.\n- Review requests - Asking for online reviews post-treatment helps in building an online presence which further enhances your online reputation. This helps in getting valuable feedback from patients. Positive reviews on Yelp, Google, and Facebook help in spreading the word about your practice.\n- Emergency situations - A lot of dentists rely on texting as a response to an immediate emergency or postoperative event. Text messaging can be used outside of business hours to keep an eye on incoming messages. This is one of the best ways to increase trust and create long-lived relationships with patients.\n- Scheduling conflicts - A schedule change is sometimes forced on practices. Being able to text everyone on your calendar is far more efficient than calling everyone one by one. This enables directly notifying patients about the schedule changes.\n- Sending appointment reminders - Sending appointment confirmation texts to patients is the most common usage of text messaging for dentists. Text messaging appointment reminders help reduce no-shows and help in communicating with your patients effectively.\n\n## Landline Texting as a type of text messaging\n\nA text-to-landline service allows you to send and receive text messages, alerts, confirmations, notifications, reminders, and market promotional campaigns online using your existing landline phone number, VoIP, or toll-free number. You can give your staff and clients flexible options to communicate by integrating your phone system with text messaging capabilities.\n\n## How can PracticeDilly assist in text messaging for dentists?\n\nFinding the right patient engagement platform is essential for a dental office to start two-way texting. The ideal partner will help in structuring, streamlining, and providing an easy-to-use messaging platform.\n\nWell, PracticeDilly is changing the way dental practices work to make their job easier. We provide you a message dashboard to send/ receive text messages, share documents and pictures with your patients via text messages.\n\nYou can also access the message board and respond to your patient's messages on the PracticeDilly mobile app. The app will let you know when a message arrives. This helps in staying in touch 24/7.\n\nApart from this, we understand the importance of privacy in conversations. Therefore, All the conversations with patients are secured and under the HIPAA compliant rules.\n\nSo, start using our patient engagement platform to stay in touch with your patients via texts, deliver urgent messages, and keep them updated."
  },
  {
    "slug": "why-get-reviews-on-yelp",
    "title": "Why You Should Still Get Reviews on Yelp for Your Dental Practice?",
    "description": "Yelp has been controversial over the years. Many business owners have complaints about Yelp's review filter algorithm and aggressive advertising practices. Despite these issues, Yelp remains an important platform for dental practices.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-05-15",
    "readTime": "5 min read",
    "category": "Reputation Management",
    "content": "Yelp has been controversial over the years. Many business owners have complaints about Yelp's review filter algorithm and aggressive advertising practices. Despite these issues, Yelp remains an important platform for dental practices.\n\n## Why Yelp Still Matters\n\nWhile Google is the dominant search platform, Yelp still attracts millions of users actively searching for local businesses, including dental practices. Here's why maintaining a presence on Yelp is important:\n\nYelp pages often appear in the top search results for local businesses. When someone searches for \"dentist near me\" or \"best dentist in [city],\" your Yelp page is likely to appear alongside your Google Business Profile.\n\nYelp has a dedicated user base that specifically uses the platform to research businesses before making decisions. These users trust Yelp reviews and actively seek them out.\n\nYelp reviews tend to be more detailed than reviews on other platforms. Users often write extensive feedback about their experiences, which can help potential patients make informed decisions.\n\n### Key Statistics\n\n- • Businesses with positive Yelp reviews can see up to 13% higher revenue\n- • 90% of consumers read online reviews before visiting a business\n- • Yelp has over 178 million unique visitors monthly\n\n## Best Practices for Managing Yelp Reviews\n\nMake sure you've claimed your Yelp business page. This gives you control over your business information and allows you to respond to reviews.\n\nWhile you should never incentivize reviews (which violates Yelp's terms of service), you can remind happy patients that you appreciate feedback on platforms like Yelp.\n\nTake time to respond to both positive and negative reviews professionally. This shows potential patients that you care about feedback and patient satisfaction.\n\nEnsure your business hours, contact information, services, and photos are current on your Yelp page.\n\n## Dealing with Negative Yelp Reviews\n\nNegative reviews happen to every business. Here's how to handle them effectively:\n\n- Show empathy and a willingness to improve\n- Never argue or get defensive\n- Offer to resolve the issue offline\n- Acknowledge the patient's concerns\n- Respond quickly and professionally\n\n## The Bottom Line\n\nDespite its controversies, Yelp remains a valuable platform for dental practices. By maintaining an active presence, responding to reviews, and providing excellent patient care, you can leverage Yelp to attract new patients and build your practice's reputation.\n\nFocus on delivering great patient experiences, and the positive Yelp reviews will follow naturally."
  },
  {
    "slug": "what-is-online-review-gating",
    "title": "What Is Online Review Gating, and Can I Still Do That?",
    "description": "Review gating is the practice of screening customers before asking them to leave a public review. In simple terms, businesses ask customers about their experience privately first.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-04-28",
    "readTime": "6 min read",
    "category": "Reputation Management",
    "content": "## What is Review Gating?\n\nReview gating is the practice of screening customers before asking them to leave a public review. In simple terms, businesses ask customers about their experience privately first. If the feedback is positive, they're directed to leave a review on platforms like Google or Yelp. If negative, they're handled through private channels.\n\nFor example, a dental practice might send a survey asking \"How was your visit?\" If the patient rates it 4-5 stars, they receive a link to Google Reviews. If they rate it 1-3 stars, they're asked to contact the office directly.\n\n## Why Did Businesses Use Review Gating?\n\nThe appeal of review gating is obvious:\n\n- It helps identify unhappy patients before they leave negative reviews\n- It increases the percentage of positive reviews on public platforms\n- It gives businesses a chance to resolve issues before they become public\n- It helps maintain high online ratings by filtering out negative reviews\n\n## Is Review Gating Allowed?\n\nNo, review gating is against policy.\n\nBoth Google and Yelp have explicitly prohibited review gating. Google updated its review policies in 2018 to ban the practice, and Yelp has always been against it.\n\n\"Don't discourage or prohibit negative reviews or selectively solicit positive reviews from customers.\"\n\n## Consequences of Review Gating\n\nEngaging in review gating can lead to:\n\n- Loss of trust from patients\n- Damage to your reputation if discovered\n- Loss of ability to collect new reviews\n- Deletion of existing reviews\n- Removal of your Google Business Profile\n\n## Ethical Alternatives to Review Gating\n\nInstead of review gating, here are ethical ways to manage your online reputation:\n\nSend review requests to all patients equally, regardless of their potential sentiment. This is compliant with platform policies and builds authentic online presence.\n\nProvide direct links to your review profiles. The easier you make it, the more reviews you'll receive from satisfied patients.\n\nAddress negative reviews professionally and publicly. This shows potential patients that you care about feedback and are committed to improvement.\n\nWhile you should ask everyone to leave public reviews, also provide ways for patients to give private feedback through surveys, email, or phone calls. Just don't make private feedback a prerequisite for review requests.\n\nThe best way to get positive reviews is to provide excellent service. Focus on delivering exceptional patient care, and positive reviews will naturally follow.\n\n### The Right Approach\n\nInstead of asking \"How was your experience?\" before sending a review link, simply:\n\n1. Make it clear that all feedback is welcome\n2. Ask them to share their honest feedback\n3. Provide a direct link to your Google Business Profile\n4. Thank patients for choosing your practice\n\n## Managing Negative Reviews\n\nWhen you receive negative reviews (and you will), handle them properly:\n\n- Show other readers that you care about patient satisfaction\n- Offer to resolve the issue offline\n- Apologize if appropriate\n- Acknowledge the patient's concerns\n- Respond within 24-48 hours\n\n## Conclusion\n\nWhile review gating might seem like an attractive shortcut to better online ratings, it's against platform policies and can seriously harm your practice. Instead, focus on providing excellent patient care, asking all patients for reviews, and responding professionally to all feedback.\n\nBuilding an authentic online reputation takes time, but it's the only sustainable and ethical approach to online review management."
  },
  {
    "slug": "reduce-appointment-no-shows",
    "title": "How Can I Reduce Appointment No-Shows?",
    "description": "Missed appointments, apart from being frustrating, result in the loss of finances and resources as well. On average, no-shows and last-minute cancellations can cost dentists up to $30,000 per year!",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2024-04-15",
    "readTime": "6 min read",
    "category": "Patient Communication",
    "content": "Missed appointments, apart from being frustrating, result in the loss of finances and resources as well. On average, no-shows and last-minute cancellations can cost dentists up to $30,000 per year! Moreover, missed appointments create many other problems in dental practices. Patients who fail to turn up deprive other patients of an opportunity for treatment.\n\nAlthough some no-shows are unavoidable, many of them can be eliminated.\n\n## Effective ways to reduce appointment no-shows\n\n### Automated Reminders\n\nThe majority of no-shows are due to patients forgetting their appointment dates. But if you provide periodic reminders to your patients that will encourage them to mark their calendars and plan the month or week accordingly, not only can you significantly reduce appointment no-shows but contribute to patient loyalty as well. However, manually sending reminder messages to hundreds of patients on different days can be very time-consuming. Send automated reminders to save both time and money. The following 3 periodic reminders will give the best results:\n\n- A reminder 2 hours before the appointment\n- A reminder two days before the appointment if the patient hasn't confirmed on their earlier reminder\n- A reminder seven days before the appointment if the appointment was created well in advance\n\n### Pre-Paid Appointments\n\nIf the patients have paid a small fee before an appointment, they are less likely to miss it. However, convincing them to do so can be challenging. But if you offer benefits like discounts or \"no-wait\" on pre-paid appointments, patients will certainly show interest.\n\n### Sorry We Missed You\n\nNot all no-shows are preventable, and some patients just cannot make it to your office on that particular day. If they miss an appointment, send them a \"Sorry We Missed You\" message immediately, and encourage them to get in touch with you to reschedule their appointment.\n\n### Perks on Patient Show Ups\n\nAnother effective way to reduce no-shows is rewarding the patients that keep their appointments. You can offer them a small discount on their next visit, which will encourage them to keep their appointments in the future. On the other hand, you can also charge a small fee for no-show patients.\n\n### Schedule Patients Quickly\n\nOne of the most common reasons for patients forgetting their appointments is late schedules. A patient is more likely to forget an appointment a month later than an appointment next week. Therefore, whenever a new patient makes an appointment, try to schedule it as soon as possible.\n\n## Conclusion\n\nMissed appointments result in a substantial loss of time and money, but you can reduce appointment no-shows by improving patient communication, sending periodic reminders, and offering perks on show-ups."
  },
  {
    "slug": "why-create-patient-record",
    "title": "Why Should I Create a Patient Record Even Before the First Visit?",
    "description": "Many dental practices wait until a patient arrives for their first appointment to create their patient record. However, there's a better way. Creating patient records before the first visit can significantly improve your practice's efficiency.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2020-03-10",
    "readTime": "6 min read",
    "category": "Practice Management",
    "content": "Many dental practices wait until a patient arrives for their first appointment to create their patient record. However, there's a better way. Creating patient records before the first visit can significantly improve your practice's efficiency and enhance the patient experience. Here's why you should consider making this change.\n\n## Streamline Your Check-In Process\n\nWhen patients arrive for their first appointment, they typically spend 15-20 minutes filling out paperwork in your waiting room. This creates several problems: your waiting room gets congested, patients become impatient, and your staff spends valuable time entering this information into your system.\n\nBy creating patient records before the first visit, you can send digital forms for patients to complete from the comfort of their home. When they arrive, they can check in quickly and move directly to the treatment area, creating a more pleasant experience for everyone.\n\n## Reduce Front Desk Workload\n\nYour front desk staff juggle multiple responsibilities—answering phones, scheduling appointments, checking patients in and out, and processing payments. Having to manually enter new patient information adds to this burden, especially during busy periods.\n\nWhen you create patient records ahead of time using digital forms, the information is automatically entered into your system. This frees up your staff to focus on providing excellent customer service rather than data entry.\n\n## Improve Data Accuracy\n\nManually entering patient information from paper forms introduces opportunities for errors. Handwriting can be difficult to read, leading to mistakes in critical information like contact details, insurance information, or medical history.\n\nDigital forms eliminate this issue. Patients enter their own information directly into the system, and you can use validation rules to ensure required fields are completed and information is formatted correctly.\n\n## Review Information Before the Appointment\n\nHaving patient records created before the appointment allows your clinical team to review the patient's medical history and prepare appropriately. If a patient has specific health conditions or takes certain medications, your dentist can be prepared with the right questions and treatment approach.\n\nThis advance preparation leads to more productive appointments and better patient care.\n\n## Reduce No-Shows and Last-Minute Cancellations\n\nWhen patients take the time to complete their paperwork before an appointment, they've invested effort into the process. This psychological commitment reduces the likelihood of no-shows or last-minute cancellations.\n\nAdditionally, the process of filling out forms reminds patients about their upcoming appointment, serving as a natural reminder that complements your automated reminder system.\n\n## How to Implement This Process\n\nAs soon as a new patient schedules an appointment, automatically send them a link to complete their new patient forms online.\n\nIf patients haven't completed their forms within a few days, send a gentle reminder. Most patients will complete the forms—they just need a nudge.\n\nSome patients may not complete forms in advance. Have tablets available in your office for these cases, so they can still complete forms digitally rather than on paper.\n\nTrain your staff to quickly review completed forms before appointments to identify any missing information or potential issues.\n\n## The Technology You Need\n\nTo implement this process effectively, you need practice management software that supports digital forms and patient communication. Look for solutions that offer:\n\n- HIPAA-compliant data handling\n- Direct integration with your practice management system\n- Reminder capabilities for incomplete forms\n- Automated form distribution after appointment scheduling\n- Customizable digital forms\n\n## Start Today\n\nCreating patient records before the first visit is a simple change that delivers significant benefits. Your staff will be more efficient, your patients will have a better experience, and your practice will run more smoothly. If you're not already doing this, there's no better time to start than today.\n\nPracticeDilly's digital forms solution makes it easy to collect patient information before appointments, automatically creating records in your system and improving your practice efficiency."
  },
  {
    "slug": "acquire-patients-email-addresses",
    "title": "Are You Acquiring Your Patients' Email Addresses?",
    "description": "Email addresses are one of the most valuable pieces of patient information you can collect. Yet many dental practices aren't systematically capturing this crucial data point.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2019-01-15",
    "readTime": "6 min read",
    "category": "Patient Communication",
    "content": "Email addresses are one of the most valuable pieces of patient information you can collect. Yet many dental practices aren't systematically capturing this crucial data point. If you're not actively acquiring your patients' email addresses, you're missing out on significant opportunities to improve communication and grow your practice.\n\n## Why Email Addresses Matter\n\nIn today's digital age, email remains one of the most effective communication channels. While text messages are great for quick reminders and confirmations, email allows you to send more detailed information, educational content, and promotional offers that patients can review at their convenience.\n\nHaving patient email addresses enables you to:\n\n- Stay top-of-mind with your patient base\n- Request feedback and reviews\n- Promote seasonal offers and new services\n- Share educational content about oral health\n- Send appointment confirmations and reminders\n\n## The Cost of Not Collecting Emails\n\nWithout patient email addresses, you're limiting your ability to communicate effectively. You're relying solely on phone calls and mail—both of which are more expensive and less efficient than email. You're also missing opportunities to build stronger relationships with your patients through regular, valuable communication.\n\n## How to Start Collecting Email Addresses\n\nMake email address a required field on all new patient forms. If you're using digital forms, this is even easier—you can make it mandatory before patients can submit their information.\n\nTrain your front desk staff to ask for email addresses when scheduling appointments, during check-in, and at checkout. Many patients are happy to provide their email if asked directly.\n\nConsider offering a small incentive for patients who provide their email address. This could be a discount on their next visit, a free whitening treatment, or entry into a monthly drawing.\n\nIf you have an online appointment booking system, make email address a required field. Your website should also have newsletter signup forms where visitors can voluntarily provide their email addresses.\n\n## Managing Your Email List\n\nOnce you start collecting email addresses, it's important to manage them properly. Use a practice management system or email marketing platform to organize your contacts. Segment your list based on patient type, treatment history, or other relevant criteria to send more targeted communications.\n\n## Best Practices for Email Communication\n\nHaving email addresses is only valuable if you use them effectively. Here are some best practices:\n\n- Comply with HIPAA regulations for any health information\n- Include clear calls-to-action\n- Make sure emails are mobile-friendly\n- Personalize messages when possible\n- Always include an easy unsubscribe option\n- Don't spam—send valuable content on a regular schedule\n\n## The Bottom Line\n\nEmail addresses are a valuable asset for any dental practice. They enable more efficient communication, help build stronger patient relationships, and create opportunities for practice growth. If you're not systematically collecting patient email addresses, start today—your future marketing efforts will thank you.\n\nPracticeDilly makes it easy to collect and manage patient email addresses, and automatically send personalized communications that strengthen patient relationships."
  },
  {
    "slug": "want-more-online-reviews",
    "title": "Want More Online Reviews? Top 4 Ways to Increase Reviews",
    "description": "Online reviews are crucial for dental practices. They influence potential patients' decisions and significantly impact your online visibility. Yet many practices struggle to generate a consistent flow of reviews.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2020-02-20",
    "readTime": "6 min read",
    "category": "Reputation Management",
    "content": "Online reviews are crucial for dental practices. They influence potential patients' decisions and significantly impact your online visibility. Yet many practices struggle to generate a consistent flow of reviews. Here are the top four proven strategies to increase the number of online reviews your practice receives.\n\n## 1. Simply Ask Your Patients\n\nThe most effective way to get more reviews is surprisingly simple: just ask. Many satisfied patients are happy to leave reviews—they simply need to be asked. The key is asking at the right time and in the right way.\n\nThe best time to request a review is immediately after a positive experience. This could be:\n\n- During checkout when patients are still in your office\n- After resolving a concern or issue to the patient's satisfaction\n- When a patient expresses satisfaction with their results\n- Right after a successful treatment\n\nTrain your team to identify happy patients and ask them naturally. A simple request works best:\n\n\"We're so glad you had a great experience today! If you have a moment, we'd really appreciate it if you could share your experience in an online review. It helps other people find our practice.\"\n\n## 2. Make It Easy\n\nEven patients who want to leave a review may not follow through if the process is complicated. Remove every possible barrier:\n\nDon't make patients search for your business on review sites. Send them a direct link that takes them exactly where they need to go. You can send these links via:\n\n- QR codes displayed in your office\n- Email (good for detailed follow-ups)\n- Text message (most effective—patients can do it immediately)\n\nDon't overwhelm patients by asking them to review you on multiple sites. Focus on the platform that matters most for your practice—typically Google, as it affects local search visibility and integrates with Google Maps.\n\n## 3. Automate Your Review Requests\n\nManually requesting reviews for every patient isn't scalable. That's where automation comes in. Set up a system that automatically sends review requests after appointments.\n\nModern dental patient communication software can automatically:\n\n- Track which patients have left reviews to avoid duplicate requests\n- Send follow-up reminders if patients don't respond initially\n- Include direct links to your preferred review platforms\n- Send review requests a few hours after appointments\n\nReview gating—the practice of only sending review requests to satisfied patients—violates most review platforms' terms of service. Your automated system should send requests to all patients, not just those you think had positive experiences.\n\n## 4. Respond to All Reviews\n\nWhen you respond to reviews—both positive and negative—you demonstrate that you value patient feedback. This encourages more patients to leave reviews because they see that you're actively engaged.\n\nKeep responses brief but personal. Thank the patient by name, reference something specific from their review, and reinforce your commitment to quality care:\n\n\"Thank you so much, Sarah! We're thrilled you had such a positive experience with Dr. Smith. We look forward to seeing you at your next visit!\"\n\nNegative reviews require more careful handling. Always:\n\n- Never violate HIPAA by discussing specific treatment details\n- Take the conversation offline to resolve the issue\n- Avoid being defensive or making excuses\n- Apologize for their negative experience\n- Respond quickly (within 24-48 hours)\n\n## Putting It All Together\n\nIncreasing your online reviews doesn't require complex strategies or expensive tools. Focus on these four fundamentals:\n\n1. Respond to all reviews to show you're engaged\n2. Automate review requests to ensure consistency\n3. Make the review process as easy as possible\n4. Ask every satisfied patient for a review\n\nImplement these strategies consistently, and you'll see a steady increase in the number of reviews your practice receives. More reviews mean better online visibility, which translates to more new patients finding and choosing your practice.\n\nPracticeDilly automates review requests and makes it easy for patients to leave reviews, helping you build a stronger online reputation without adding work for your team."
  },
  {
    "slug": "when-start-getting-reviews",
    "title": "When Will You Start Getting Online Reviews for Your Dental Practice?",
    "description": "The answer to when you should start getting online reviews for your dental practice is simple: today. Right now. This moment. Whether you're a brand new practice or have been established for decades, there's no better time to start building your online reputation than immediately.",
    "author": "Pavan Chakka",
    "authorRole": "CEO & Co-Founder",
    "date": "2020-04-05",
    "readTime": "6 min read",
    "category": "Reputation Management",
    "content": "The answer to when you should start getting online reviews for your dental practice is simple: today. Right now. This moment. Whether you're a brand new practice or have been established for decades, there's no better time to start building your online reputation than immediately.\n\n## Why Start Now?\n\nEvery day you wait is a day you're missing opportunities. Potential patients are searching for dental practices online right now. They're reading reviews and making decisions about which practice to call. If you don't have reviews, or if your reviews are sparse or outdated, you're at a significant disadvantage.\n\nResearch shows that 88% of consumers trust online reviews as much as personal recommendations. When potential patients see multiple recent reviews praising your practice, it builds immediate trust and credibility. This trust makes them more likely to choose your practice over competitors.\n\nGoogle's local search algorithm considers the quantity, quality, and recency of reviews when determining search rankings. More reviews mean better visibility in local search results. Better visibility means more potential patients discovering your practice.\n\n## For New Practices: Start on Day One\n\nIf you're opening a new dental practice, start requesting reviews from your very first patients. Don't wait until you have \"enough\" patients or until you're \"established.\" Every patient interaction is an opportunity to build your online reputation.\n\nGetting that first review can feel daunting, but it's crucial. Once you have one review, the next becomes easier. Patients are more likely to add their voice to an existing conversation than to be the first to speak up. Your goal should be to get your first 5-10 reviews as quickly as possible.\n\nDon't be shy about asking friends and family members who are patients to leave honest reviews. As long as they're genuine patients who have experienced your care, their reviews are legitimate and valuable.\n\n## For Established Practices: Better Late Than Never\n\nIf you've been practicing for years but haven't actively sought reviews, don't worry—it's not too late. Many established practices discover they're sitting on a goldmine of satisfied patients who would happily leave reviews if asked.\n\nEstablished practices often have an advantage: a large base of existing patients. You can quickly build your review profile by implementing a systematic review request process. Within a few months, you can accumulate enough reviews to compete with practices that started earlier.\n\nGoogle and other platforms value recent reviews more highly than old ones. This works in your favor—even if competitors have been collecting reviews for years, you can still compete by generating a steady stream of fresh, recent reviews.\n\n## How to Start Today\n\nReady to begin? Here's a simple action plan you can implement immediately:\n\nMake sure you've claimed your business profiles on Google, Yelp, and other relevant platforms. You can't collect reviews if patients can't find you.\n\nGenerate direct links to your review profiles that you can easily share with patients. These links should take patients directly to the review form, not just your business profile.\n\nBrief your entire team on the importance of reviews and teach them how to identify opportunities to request them. Make it part of your standard checkout process.\n\nBegin requesting reviews from satisfied patients today. Send text messages or emails with direct review links to recent patients who had positive experiences.\n\nOnce you've gotten started manually, implement automated review request software to ensure you're consistently requesting reviews from every patient without adding work for your team.\n\n## Set Realistic Expectations\n\nWhile you should start today, understand that building a strong review profile takes time. Not every patient will leave a review—in fact, only a small percentage will. That's normal. The key is consistency: keep requesting reviews from every satisfied patient, and over time, your review profile will grow.\n\nMost practices see review response rates between 5-15%. That means if you request reviews from 100 patients, you might get 5-15 reviews. This is why it's crucial to request reviews from all patients, not just a select few.\n\nThe good news is that review generation tends to build momentum over time. As you accumulate more reviews, patients see that others are leaving reviews, which makes them more likely to do so themselves. Your review rate often improves as your total number of reviews grows.\n\n## The Bottom Line\n\nStop waiting for the \"perfect time\" to start collecting reviews. That time is now. Every day you delay is a day you're falling behind competitors who are actively building their online reputation. Your satisfied patients want to help you succeed—you just need to give them an easy way to do so.\n\nStart today, be consistent, and in a few months, you'll look back and be grateful you didn't wait any longer.\n\nPracticeDilly makes it easy to collect reviews consistently with automated requests, direct review links, and tools to monitor your online reputation. Get started today."
  }
]
