[
  {
    "slug": "picasso-smiles-dental",
    "title": "Picasso Smiles Dental: Increased Online Reputation by 3x in 9 Months",
    "description": "Picasso Smiles Dental took advantage of our online reputation management solution to increase their online reputation by 3x in 9 months. Check out how.",
    "featured": true,
    "location": "California and Texas",
    "website": "https://picassosmiles.com/",
    "content": "We met Dr. Nima Shayesteh at the California Dental Association Conference in May 2018. We learned that he didn't have automated appointment reminder software, nor a patient texting service.\n\nWe gave him a 90-day free trial of PracticeDilly, along with the mobile app. The team at Picasso Smiles Dental loved the results. Not only did they become outspoken supporters of our product, but they also provided valuable feedback on aspects that could be improved on - many of those ideas have since then been implemented into PracticeDilly.\n\n## Life Before PracticeDilly\n\nMuch like Mike Shannon's practice mentioned in their case study, Picasso Smiles relied mostly on manual input for their scheduling. Appointments were scheduled, rescheduled, canceled, and confirmed via email and phone conversations, presenting the same old obstacles - significant man-hours, and unresponsive clients.\n\nDr. Shayesteh wanted to improve accessibility between the practice and the clients; easing communication and increasing the amount of positive feedback was very important to him.\n\n## Life After PracticeDilly\n\nDr. Nima Shayesteh and his entire office were incredibly impressed with our software. So much so, in fact, that he implemented it into two more of his Texas offices! He has also been a vocal supporter of our product and has recommended it to many of his friends in the industry.\n\nOur appointment software greatly increased productivity and client feedback, and continues to produce great results.\n\n\"Before PracticeDilly, PicassoSmiles had about 40 Google reviews. After adopting it, that number tripled to 120 and counting in just nine months.\"\n\n## Testimonials\n\n\"PracticeDilly is a platform that not only saves hours of staff time, but also patients love interacting with us via text messages for appointment booking and confirmation and also general questions. Pavan, the CEO and app developer is very kind and has implemented our ideas into this platform. PracticeDilly continues to grow in functionality and improved user interface. Thank you so much Pavan, our patients love us so much more now with the implementation of your platform!\"\n\nDr. Nima Shayesteh, D.M.D.\n\nConcierge Smile Boutique\n\n5 out of 5\n\n\"My experience with PracticeDilly thus far has been very beneficial, effectual, and rewarding with great reviews.\"\n\nLucy Santos\n\nOffice Manager, Concierge Smile Boutique\n\n5 out of 5",
    "relatedSlugs": ["village-family-dental", "mike-shannon-dds", "pacific-ocean-dental-group"]
  },
  {
    "slug": "pacific-ocean-dental-group",
    "title": "Pacific Ocean Dental Group: From 2.5 to 4.6 Google Rating in 6 Months",
    "description": "Pacific Ocean Dental Group took advantage of our online reputation management services to gain more positive reviews online in 6 months. Find out how.",
    "featured": false,
    "location": "Los Angeles, CA",
    "website": "https://www.pacificoceandental.com",
    "content": "## Overview\n\nOnline presence has become very critical for all businesses. Reviews on Google, Yelp, and Facebook have become an important part of that online presence. 84% of people trust online reviews.\n\nFor dental practices, online reviews have become the determining factor in whether someone will visit that practice or not. 90% of patients read online reviews before choosing a dental practice.\n\nSo, it's important to have positive online reviews to build a thriving dental practice. Here's a case study that portrays how we assisted one such dental practice in getting more positive reviews with the help of our online reputation management solution.\n\n## Background\n\n### Hyun Sook Lim, DDS, MS, Los Angeles Dentist\n\nPacific Ocean Dental Clinic\n\n5807 N Figueroa Ave, Los Angeles, CA 90042\n\nwww.pacificoceandental.com\n\nDr. Lim holds a Master's Degree in Periodontology and has received additional training in Cosmetic Veneers and Dental Implants. She has continued to stay on top of the latest dental trends and techniques. She is very caring and all of her patients love her. Many of her patients have been visiting her for several years, and she has a great reputation in her area.\n\n## Challenge\n\n### Improve average rating on Google\n\nIn the USA, dental practices have an average of 4-star ratings, so Dr. Lim was worried about her office, which had an average of only 2.5 stars on Google. This wasn't a reflection of her practice, as she took good care of her patients, who kept on coming back. She knew that increasing her average rating on Google was critical in growing her practice.\n\nThere were several 1-star ratings on Pacific Ocean Dental Group's Google profile, and many without an explanation. Dr. Lim couldn't figure out exactly who those reviews were from but suspected they could have been from past employees. She suspected that these ratings could be driving some of her prospective patients away from her office and wanted to fix it. She even reached out to Google to see if they could remove the reviews that weren't actually from her patients, but even Google could not help.\n\n## Solution\n\n### Get more Google reviews from Pacific Ocean Dental Group's Happy Patients\n\nDr. Lim came to know about PracticeDilly from a marketing agency.\n\nOne of PracticeDilly's core features is to help dental practices consistently get online reviews on profiles like Google, Yelp, and Facebook.\n\nWe suggested that Dr. Lim not worry about her existing bad ratings and instead consistently add reviews from her many happy patients. We then set up PracticeDilly for her office, which made it easy for the front office to request an online review and also for the patients to simply tap on a link in the text message that would automatically take them to Dr. Lim's Google, Facebook, and Yelp profiles.\n\nWith a collective effort from Dr. Lim's front office and PracticeDilly's program, in six months, were able to bring the average rating of Pacific Ocean Dental Group from 2.5 stars to 4.6 stars on Google. Along the way, we also added many positive reviews to her Yelp and Facebook profiles.\n\nNow that Dr. Lim has a better online presence, she is seeing a consistent growth in the number of new patients visiting her office. We can now say confidently that Dr. Lim is not worried about those few bad reviews anymore.",
    "relatedSlugs": ["picasso-smiles-dental", "village-family-dental", "mike-shannon-dds"]
  },
  {
    "slug": "saghi-parham-dds",
    "title": "Dr. Saghi Parham DDS: PracticeDilly is better than most.",
    "description": "Learn why Dr. Saghi Parham DDS chose PracticeDilly over others when looking for an all-in-one patient engagement platform for her dental practice.",
    "featured": false,
    "location": "Beverly Hills, CA",
    "website": "https://www.cosmeticbeverlyhillsdentist.com",
    "content": "## Overview\n\nPricing is crucial for any practice to strive in the market. The flexible spend approach coupled with all valuable features is what every business longs for.\n\nAn all-in-one seamless platform with multiple tools, best pricing, great support, and real-time communication works best for dental practices.\n\nConsidering this, Dr.Saghi Parham, DDS, chose to partner with PracticeDilly because of its simple-to-use patient engagement software and affordable pricing.\n\n## Background\n\n### Dr. Saghi Parham (D.D.S), Cosmetic Beverly Hills Dentist\n\nSaghi Parham, DDS.\n\n9735 Wilshire Boulevard, Suite 324 Beverly Hills, CA 90212\n\nwww.cosmeticbeverlyhillsdentist.com\n\nDr. Parham received a degree of Bachelor of Science with a major in biology from the University of California, Los Angeles, in 1993. She received her Doctor of Dental Surgery degree from the University of Southern California, School of Dentistry, in 1998. Dr. Parham was also the recipient of an award for excellence in education and graduated with recognition on the dean's list. She held a part-time position as an Associate Clinical Professor at the USC School of Dentistry. Dr. Parham continuously keeps abreast of dentistry's latest advances and developments, participating in numerous continuing education courses, including Advanced Implant training and Advanced Cosmetic Dentistry training.\n\n## Challenge\n\nBefore choosing PracticeDilly, Dr. Parham was using another patient engagement platform Demandforce. It had been a concern of hers in all this time that she had to pay an extremely high price for the minimal features.\n\nShe could not make up her mind even after taking demos from various other software like Revenuewell, Lighthouse 360. This was when an already existing customer of PracticeDilly recommended her to give a try to our software.\n\nOur Product Manager and Co-founder, Mr. Pavan Chakka, got on a call with her and explained to her about the myriad of app features like paperless forms, mass texting, automated reminders, online reviews, etc., that we offer at affordable prices. She was overwhelmed with our services and decided to enroll in our free trial.\n\nHer only doubt was whether transitioning to PracticeDilly will be troublesome for her dental office? We cleared all her queries and explained how super easy it is to transition to our software.\n\n## Solution\n\nDr. Parham is one of our significant clients. Our all-in-one patient engagement platform has helped her cut down on her expenditures by almost twice the amount she spent previously. Not just this, she has been able to reel in more online reviews. Ever since listening to our advice, Dr. Parham has received an increase of 75% in online reviews on Google and Yelp within a month of transitioning to our patient engagement software.\n\nThe success story of our software can be judged from the appreciation received from Dr. Parham, as she is delighted to use our mobile app to schedule all her appointments and stay in touch with her patients and staff anytime and from anywhere.\n\nWithin a month of using our software, Dr. Parham's dental office has become more efficient and cost-effective.",
    "relatedSlugs": ["picasso-smiles-dental", "village-family-dental", "mike-shannon-dds"]
  },
  {
    "slug": "village-family-dental",
    "title": "Village Family Dental: Increased Efficiency = Better Care",
    "description": "Discover how Village Family Dental improved efficiency and built stronger relationships with patients by utilizing our all-in-one patient engagement platform.",
    "featured": false,
    "location": "",
    "website": "",
    "content": "## Life After PracticeDilly\n\nThe easiest way to evaluate the success of PracticeDilly at Village Family Dental is to ask Dr. Hung himself - ever since implementing it, he's been a strong, outspoken advocate.\n\nDr. Hung was excited to tell us how they were able to introduce long-overdue systems into their office, such as welcome emails, automatic recalls, and even fun little things like birthday wish emails, which served to improve rapport between practice and patients.\n\nUltimately, Dr. Hung's office became more efficient, the patients grew more responsive, and hundreds of man-hours were freed up for the office staff, allowing them to focus on other important tasks.\n\n## Key Benefits\n\n### Welcome Emails\n\nAutomated welcome communications for new patients\n\n### Automatic Recalls\n\nNever miss a patient follow-up appointment\n\n### Birthday Wishes\n\nBuild stronger patient relationships with personal touches\n\n### Time Savings\n\nHundreds of man-hours freed up for staff",
    "relatedSlugs": ["picasso-smiles-dental", "mike-shannon-dds", "future-dental-care"]
  },
  {
    "slug": "mike-shannon-dds",
    "title": "How Mike Shannon DDS Managed to Reduce Appointment No-Show Rate!",
    "description": "Learn why Mike Shannon DDS likes PracticeDilly's mobile app for communicating with patients, resulting in reduced no-shows and eliminating manual tasks.",
    "featured": false,
    "location": "",
    "website": "",
    "content": "## Life Before PracticeDilly\n\nBefore Mike Shannon DDS. Pediatric Dental Practice used PracticeDilly, everything was done manually. They would send out email reminders to each and every one of their patients, many of which would never get a response. They also set appointments and reminders over the phone, and each confirmation had to be logged into the system. All of this work combined would eat up almost half of their entire work day!\n\n### Challenges\n\n- Many Unresponsive Clients\n- Manual Input Errors Sometimes Caused Confusion\n- 30-45 Minutes a Day On Phone Calls\n- 2-3 Hours a Day Sending Emails\n- All Scheduling Was Done Manually\n\n## Life After PracticeDilly\n\nMike Shannon's office was immediately impressed by the results of our automation software. PracticeDilly made it far easier for clients to confirm their appointments - a simple click of a button or a quick text was all it took, and the results were easy to track because the software synced with their schedule. PracticeDilly also automated the entire scheduling process, freeing up several man-hours each day, allowing the office to run far more efficiently and effectively.\n\n### Outcomes\n\n- Decreased No-Show Appointments\n- Freed Up Valuable Time for Front Office Staff\n- No Room for Human Errors\n- Almost All Manual Input Work Eliminated\n- Far More Client Confirmations",
    "relatedSlugs": ["picasso-smiles-dental", "village-family-dental", "future-dental-care"]
  },
  {
    "slug": "future-dental-care",
    "title": "How Dr. Mudita Thrived During the Pandemic",
    "description": "Learn how Future Dental Care was able to increase its Google and Yelp reviews by 20x, appointments bookings by 5x, and revenue by 200% using PracticeDilly.",
    "featured": false,
    "location": "San Francisco, CA",
    "website": "",
    "content": "Dr. Mudita Agarwal is the owner of Future Dental Care. She has been practicing dentistry for almost 10 years now. Her overall philosophy is to treat her patients, in the same manner, she would like to be treated. She treats all of her patients with dignity and has built a reputation as a skilled, caring, and compassionate dentist for whom patient comfort is always paramount.\n\n## The Challenge\n\nIn the weeks leading up to the pandemic, Dr. Mudita bought a practice from another dentist in the hopes of growing it and catering to the local area's patient's needs. But soon realizing the severity of outcomes associated with the disease and its high rate of transmission, dentists were instructed by regulatory authorities, such as the American Dental Association, to stop providing treatment to dental patients except those who have emergency complaints.\n\nAside from that, having her practice in San Francisco was itself a challenge. To compete with other dentists in her area, she had to maintain a good online reputation. Further, her practice was lacking in staff capable of handling routine communication with patients.\n\nOne problem led to another and now in the middle of the pandemic, she was looking for an all-in-one solution that can curb her problems.\n\n## The Solution\n\nIn her search for a mobile app that could integrate with Eaglesoft and allow her to access appointments on her phone and communicate with her patients, Dr. Mudita discovered PracticeDilly in the AppStore.\n\nAfter taking a demo with us, she realized that apart from a mobile app we offer a lot of other features like:\n\n- Online Reputation Management\n- Auto-recalls\n- Appointment Reminders\n\n## Results\n\n20x\n\nIncrease in Google and Yelp reviews combined\n\n5x\n\nIncrease in show-up rate, appointments booking\n\n200%\n\nIncrease in revenue\n\n## How We Did It\n\n### Automated Online Reviews\n\nPracticeDilly automated the online review requests from happy patients.\n\n### Appointment Reminders\n\nAutomated appointment reminders sent out ahead of meetings.\n\n### Expand Patient Base\n\nBy deploying PracticeDilly for all of its routine communication tasks, Future Dental Care was able to expand its current patient base.",
    "relatedSlugs": ["picasso-smiles-dental", "pacific-ocean-dental-group", "mike-shannon-dds"],
    "stats": [
      {
        "value": "20x",
        "label": "Increase in Google and Yelp reviews combined"
      },
      {
        "value": "5x",
        "label": "Increase in show-up rate, appointments booking"
      },
      {
        "value": "200%",
        "label": "Increase in revenue"
      }
    ]
  }
]
